app/controllers/products_controller.rb

SELECT COUNT(*) FROM "products"
SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 40]]
---
    def index
        @ad = {
            title: "這是廣告",
            des: "這是廣告內文",
            action_title: "閱讀更多",
        }

        @products = Product.all # call database

        @first_page = 1
        count = @products.count
        @last_page = (count / LIMIT_PRODUCT_NUMBER_A_PAGE)
        if (count % LIMIT_PRODUCT_NUMBER_A_PAGE != 0)
            @last_page += 1
        end

        # 決定每頁要呈現的產品
        # Query String 是url中”?”號後面的任何字串
        if params[:page] # 避免主頁面沒有query的情況
            @page = params[:page].to_i - 1 # get current apge
        else
            @page=0
        end
        @products = @products.offset(@page * LIMIT_PRODUCT_NUMBER_A_PAGE).limit(LIMIT_PRODUCT_NUMBER_A_PAGE)

INSERT INTO "products" ("name", "description", "image_path", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test new"], ["description", "hihi"], ["image_path", "hihi"], ["created_at", "2022-07-19 02:28:19.976660"], ["updated_at", "2022-07-19 02:28:19.976660"], ["price", 1999]]
---
    def create

        product = Product.create(product_permit)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 107], ["LIMIT", 1]]
---
    def edit
        @product = Product.find(params[:id])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "macbook ver02"], ["updated_at", "2022-07-12 02:48:41.177418"], ["id", 1]]
---
    def update
        product = Product.find(params[:id]) # 拿出指定product
        product.update(product_permit)